<template>
  <section class="">
    <main-layout>
      <template slot="header"></template>
      <div class="content">
        <div class="container">
          <div class="row">
            <div class="col-lg-4">
              <div class="list-group">
                <a href="#" class="list-group-item list-group-item-action active">
                  История
                </a>
                <a
                v-for="(hystory, index) of hystorys"
                  href="#"
                  class="list-group-item list-group-item-action"
                  @click="selectHystory(index)"
                  > {{hystory.tittle}}
                </a>
              </div>
            </div>
            <div class="col-lg-8">
              <img
                v-bind:src="currentHystory.image"
                v-bind:alt="currentHystory.tittle"
                class="list__img img-fluid"
              >
              <h3 class="hystory-tittle">{{currentHystory.tittle}}</h3>
            <p class="hystory-text">{{currentHystory.text}}</p>
            </div>
          </div>
        </div>
      </div>
      <template slot="footer"></template>
    </main-layout>
  </section>
</template>
<script>
import MainLayout from '@/layout/MainLayout.vue';
export default {
  name: 'hello',
  data () {
    return {
      hystorys:hystorys,
      currentHystory: hystorys[0]
    }
  },
  methods: {
    selectHystory: function(index){
      this.currentHystory = hystorys[index];
    }
  },
  components: {
    MainLayout
  }
}
function hystory(tittle, text, image) {
  return {
    tittle, text, image
  }
}
const hystorys = [
  hystory(
    'Benz & Cie.',
    '1 октября 1883 Карл Бенц основал компанию «Бенц и Ко. Райнише Газмоторен-Фабрик, Манхайм» (Benz & Cie.) в форме открытого торгового общества вместе с бизнесменом Максом Каспаром Розе и коммерсантом Фридрихом Вильгельмом Эсслингером. В 1886 году предприятием была создана первая трёхколёсная самоходная повозка с бензиновым двигателем. В этом же году 29 января её создатель — Карл Бенц — получил патент DRP No. 37435 на это изобретение). Впоследствии трёхколёсный автомобиль был запущен в серийное производство. В 1893 году Карл Бенц получил патент DRP No. 73515 для двойного стержня управления и инициировал выпуск четырёхколёсных автомобилей «Виктория» с двигателем мощностью 3 л. с., скорость которых составляла 17-20 км/ч. За первый год было продано 45 таких автомобилей. В 1894 году компания начала выпуск автомобилей модели «Velo», которые участвовали в первых автомобильных гонках Париж — Руан. В 1895 году был создан первый грузовик, а также первые в истории автобусы. Через год, в 1896 году, фирма Benz & Cie. разработала первый цилиндр для двигателей, которые Бенц назвал «contra engine», поскольку цилиндры были установлены противоположно друг другу. В 1901 году, вскоре после выпуска Даймлером новой модели «Mercedes 35 PS», становится понятно, насколько фирма отстаёт от прогресса. С целью улучшения положения акционеры приглашают в компанию французского инженера Мариуса Барбару. Из-за технических разногласий Карл Бенц покинул собственную компанию. Вскоре стало ясно, что французский конструктор не оправдывает возложенных на него надежд. Следуя логике, что немецкие автомобили должны делаться немцами, в фирму на должность главного инженера приглашён Фриц Эрле. Эта идея также оказалось неудачной. Только с приходом в компанию талантливого инженера Ганса Нибеля дела постепенно начали идти в гору. В 1909 году, создав целый ряд успешных легковых автомобилей, фирма построила самый известный гоночный автомобиль того времени «Блитцен Бенц» с двигателем мощностью в 200 лошадиных сил и рабочим объёмом 21 594 см3. В послевоенные годы было создано множество новых моделей, большинство из которых с успехом выпускались до середины двадцатых годов. Всего с момента начала производства в 1886 году и до объединения с «Даймлер-Моторен-Гезелльшафт» в 1926 году, фирма «Бенц и Ко.» произвела 47 555 транспортных средств, включая легковые автомобили, грузовики и омнибусы.',
    'http://www.pastil.tk/pics/86349545.jpg'
  ),
  hystory(
    'Daimler-Motoren-Gesellschaft',
    'В декабре 1883 года Готлиб Даймлер защитил собственный «газовый двигатель с зажиганием от горячей трубки» патентом DRP No. 28022. Также он получил патент DRP No. 28243 на систему «регулирования оборотов двигателя с помощью выпускного клапана». Эти два патента послужили основой для первого быстроходного двигателя внутреннего сгорания. 29 августа 1885 года Готлиб зарегистрировал Daimler Reitwagen («верховая повозка») с «газовым или бензиновым двигателем», получив патент DRP No. 36423. В 1889 году он представил новый двухцилиндровый V-образный двигатель, развивающий мощность в 1,5 л. с. при 600 об/мин. Через год, весной 1890 года, Вильгельм Майбах сконструировал первый 4-цилиндровый, четырёхтактный двигатель. Автомобиль, оснащённый данным силовым агрегатом, обладал весом в 153 кг и развивал мощность в 5 л. с. при 620 оборотах в минуту. 28 ноября 1890 года Готлиб Даймлер совместно со своими партнёрами, Вильгельмом Майбахом и Максом Дуттенхофером (нем. Max Duttenhofer), основали компанию «Даймлер-Моторен-Гезелльшафт» в районе Бад-Канштат (Штутгарт), решив выпускать четырёхколёсный автомобиль, созданный ими четырьмя годами ранее. 18 марта 1895 года компания Daimler-Motoren-Gesellschaft доставила в Кронштадт первый в мире грузовик с двухцилиндровым двигателем, мощностью 4 л. с. Через два года летом DMG представило «Phönix» — первый тип автомобилей с двигателями в передней части.После ряда не очень удачных попыток, которые всё же нашли своих восторженных покупателей, конструктору В. Майбаху в 1901 году удалось создать успешный образец — Mercedes 35 PS. По настоянию консула Австро-Венгерской империи в Ницце и по совместительству главы представительства «Даймлер» во Франции Эмиля Еллинека новый автомобиль назван в честь Девы Марии Милосердной (фр. Maria de las Mercedes, от латинского «merces» — «дары»), в честь которой также названы все его дети, в числе которых небезызвестная дочь консула Мерседес, и имущество (яхты, дома, отель и казино). Первый «Мерседес-35PS» обладал четырёхцилиндровым двигателем рабочим объёмом 5913 см3, классическим расположением основных агрегатов и стильной (по тем временам) внешностью. Через год свет увидел более совершенную конструкцию под названием «Мерседес-Симплекс». Кроме того, расширился модельный ряд. Самые известные представители этой серии именовались как «Mercedes-40/45PS» и «Mercedes-65PS», и оснащались двигателями рабочим объёмом в 6785 см3 и 9235 см3 соответственно, позволявшие развивать скорость до 90 км/ч. До Первой мировой войны компания «Даймлер-Моторен-Гезелльшафт» успела выпустить широкий модельный ряд собственных автомобилей с различными двигателями (от 1568 см3 до 9575 см3), рассчитанных на широкий круг потребителей, включавший роскошные, практически бесшумные автомобили, оснащённые двигателями с бесклапанным газораспределением, произведённые по патенту американской компании «Найт». Сразу же после войны Пауль Даймлер, сын Готлиба Даймлера, начал проводить эксперименты с компрессором, позволяющим в полтора раза повысить мощность двигателя. Занявший должность главного инженера в 1923 году Фердинанд Порше довёл эксперименты до логического завершения, создав в 1924 году один из самых выдающихся автомобилей мира — «Mercedes-24/100/140PS» с новым шасси и шестицилиндровым компрессорным двигателем рабочим объёмом 6240 см3, развивающим мощность в 100—140 лошадиных сил.',
    'http://brownsofryton.co.uk/wp-content/uploads/2016/01/5.jpg'
  ),
  hystory(
    'Объединение конкурентов',
    'Первая мировая война, обрушение курса валюты, а также проникновение на внутренний рынок Германии зарубежных производителей, таких как Ford Motor Company привели к серьёзному структурному кризису в немецкой автомобильной промышленности. 28 июня 1926 года две конкурирующие фирмы решили объединиться, образовав новый концерн Daimler-Benz, который смог эффективно использовать опыт и знания конструкторов обеих компаний. Руководителем нового предприятия был назначен Фердинанд Порше. Он полностью обновил производственную программу, взяв за основу последние модели Daimler-Motoren-Gesellschaft, выпускавшиеся теперь под маркой Mercedes-Benz. Первой новой разработкой Порше в 1926 году стала компрессорная серия, включавшая модель Mercedes 24/100/140 PS с шестицилиндровым мотором рабочим объёмом 6240 см3. За большую мощность и скорость (до 145 км/ч) её прозвали «смертельной ловушкой». Она стала базовой для более известной серии S, состоявшей из моделей S (Sport), SS (Supersport), SSK (Supersport Kurz — «суперспорт короткий») и SSKL (Supersport Kurz leicht — «суперспорт короткий лёгкий»). В 1928 году Порше покинул Daimler-Benz, а его место занял Ганс Нибель (нем. Hans Nibel)[19]. Под его руководством выпускались легковые автомобили Mannheim 370 (англ.) с шестицилиндровым мотором рабочим объёмом 3,7 л. и Nürburg 500 (англ.) с восьмицилиндровым 4,9-литровым агрегатом, базировавшимися на последних разработках Порше.В 1930 году появился «Большой Мерседес» (нем. Großer Mercedes) или Mercedes-Benz 770 (W07) с восьмицилиндровым 200-сильным двигателем, рабочим объёмом в 7655 см3 с нагнетателем. В 1931 году фирма дебютировала в секторе малолитражных автомобилей, где её представлял весьма успешный Mercedes 170 (англ.) с шестицилиндровым мотором, рабочим объёмом в 1692 см3 и независимой подвеской передних колёс. В 1933 году появились легковой Mercedes-Benz 200 и спортивный Mercedes-Benz 380 (англ.) с 2,0- и 3,8-литровыми моторами. Последний из них был оснащён нагнетателем и имел мощность в 140 лошадиных сил. На базе спортивной модели в 1934 году создали Mercedes-Benz 500K с 5-литровым двигателем, ставший через два года основой для более известного большого компрессорного автомобиля Mercedes-Benz 540K (англ.). В 1934—1936 годах фирма выпустила лёгкий Mercedes-Benz 130 (англ.) с четырёхцилиндровым 26-сильным двигателем заднего расположения, рабочим объёмом всего 1308 см3, за которым последовали родстер 150 (англ.) и седан 170H (англ.). Под техническим руководством главного конструктора Макса Зайлера, сменившего Нибеля в 1935 году, созданы популярная недорогая модель 170V с четрёхцилиндровым мотором рабочим объёмом 1697 см3, первый в мире серийный легковой автомобиль с дизельным двигателем Mercedes-Benz 260 D (1936 год), а также новый «Большой» Mercedes-Benz 770 (W150) (1938 год) с рамой из балок овального сечения и задней пружинной подвеской, служивший нацистским лидерам.',
    'http://joburgexpat.com/wp-content/uploads/2017/06/2017-06-27-road-test.jpg'
  ),
  hystory(
    'Послевоенный период',
    'На послевоенное восстановление разрушенных заводов потребовалось время, поэтому автомобильное производство было начато только в июне 1946 года. Для разработки новых автомобилей не было ни технической базы, ни средств, поэтому первым послевоенным автомобилем стал седан W136 — «170V». Хотя конструкция была разработана ещё в середине 1930-х годов, малолитражный автомобиль с мотором всего 38 лошадиных сил стал началом новой истории марки. Уже с мая 1949 года была проведена крупная модернизация. Рабочий объём двигателя увеличен на 70 см3, (соответственно мощность выросла до 52 л. с.; модель «170S»), появились варианты в кузовах кабриолет и универсал (т. н. кабриолеты «А» и «B») и главное — модели с дизельными двигателями «170D». К началу 1950-х годов концерн Daimler-Benz строил крупные планы на будущее, однако запуск нового поколения автомобилей требовал дальнейшего развития производственной базы. Поэтому в начале 1950-х годов, несмотря на появление новой роскошной серии «300», продолжался выпуск моделей с морально устаревшей конструкцией. Продолжалась постоянная модернизация и запуск новых моделей. Так в январе 1952 года появилась модель с увеличенным кузовом, которая получила номер W191. Но ещё до этого, в марте 1951 года, на автомобиль поставили шестицилиндровый двигатель с мощностью 80 л. с. вместо 4-хцилиндрового. Вместе с новым дизайном экстерьера (например, расположение передних фонарей в крылья) автомобиль W187 получил новое имя «220» и занял средний сегмент между «170»-ми и «300»-ми. Он предлагался в трёх кузовах (седан и кабриолеты «А» и «B»). Всего за девять лет (выпуск завершился в сентябре 1955 года) построено соответственно 151 042 и 18 514 автомобилей «170» и «220». Благодаря им компания смогла создать прочный фундамент, на котором она станет ведущим автомобильным производителем в Западной Европе.',
    'https://www.mercedes-benz.fr/passengercars/content-pool/tool-pages/main-navigation/_jcr_content/par/mainnavigationitemfl/par2/mainnavigationteaser_1964152185/image.MQ6.12.20180625112107.jpeg'
  ),
  hystory(
    'Аденауэры',
    'После успешного восстановления заводов и производства своих малолитражных автомобилей, к концу 1940-х годов компания вновь приступила к восстановлению своего довоенного бренда как производителя роскошных автомобилей. Учитывая современные прорывы в моде автомобилестроения, в ноябре 1951 года на Парижском автосалоне появился новый представительский лимузин W186 «300». Автомобиль, хоть и был построен в классической компоновке (отдельная рама и кузов), однако оснащался мощным 6-цилиндровым двигателем рабочим объёмом в 2996 см3 с верхним распределительным валом. Новая модель производилась в двух кузовах — седан и четырёхдверный кабриолет «D» и имела огромный успех среди крупных бизнесменов, знаменитостей и политиков. Именно последняя категория и дала автомобилю неофициальное название в честь первого федерального канцлера ФРГ, Конрада Аденауэра, который имел личный автомобиль и высоко его оценил. Так как сборка автомобиля проводилась вручную, интерьеры делались под покупателей и оснащались радио, телефоном и многими другими новшествами. Ручная сборка автомобилей позволяла проводить непрерывные модернизации, поэтому в конце 1954 года появилась серия W186 «300b», которая получила новые тормозные барабаны и передние форточки. Год спустя её заменила «300с», оснащённая автоматической коробкой передач фирмы Borg-Warner. Но самый большой шаг вперёд был сделан в середине 1950-х годов, когда фирмой Bosch было сделано изобретение системы впрыска топлива. Ей с 1955 года оснащали серию W188 «300Sc». В январе 1952 года появилась ещё одна серия представительского класса W188 — «300S», которая выпускалась в нескольких кузовных модификациях: купе, кабриолет «А» и двухместный родстер. Степень сжатия двигателя увеличена до 7,8:1, а мощность составила 150 л. с. Если сборка больших «аденауэров» шла относительно быстро (около тысячи в год, учитывая совокупные возможности заводов марки), то средний выпуск автомобилей «300S» был не более ста штук в год.Однако, если спрос на крупные «аденауэры» продолжался, то выпуск малосерийных «300S» стал непрактичным после появления родстеров SL и аналогичных двухдверных понтонных моделей в середине 1950-х годов (см. ниже). Дальнейшая сборка морально устаревших автомобилей оказалась для фирмы большим бременем, поэтому в 1958 году выпуск всех трёх кузовов W188 был прекращён после выпуска всего лишь 760 автомобилей.Что же касается флагманских седанов и кабриолетов «D», то в августе 1957 года была проведена основательная модернизация автомобиля, который стал именоваться как W189 — «300d». Главное внешнее отличие было в хвостовой части кузова, которая приобрела форму понтонного седана. Аналогично изменила форму и задняя часть крыши с увеличенным хвостовым стеклом. Боковое остекление также получило очень удобную для летнего времени возможность убрать центральную стойку. Для успешного проникновения на рынок США автомобили оснащали кондиционерами и гидроусилителями руля, а шины окрашивали в белый цвет. Двигатель нового «аденауэра» оснастили системой впрыска топлива, благодаря чему его мощность равнялась 180 л. с., а максимальная скорость тяжёлого автомобиля достигала 165 км/ч. Сборка «аденауэров» продолжалась до марта 1962 года. Всего за время производства было собрано 8288 автомобилей серии W186 и 3142 серии W189. Благодаря этому модельному ряду бренд Mercedes-Benz полностью восстановил свою довоенную репутацию производителя роскошных автомобилей.',
    'http://www.apr-remaps.co.uk/images/gallery/4.jpg'
  ),
  hystory(
    'SL (Sport Leicht)',
    'Одновременно с производством легковых автомобилей фирма уделяла немало внимания восстановлению гоночной репутации. Целое бюро занималось созданием лёгких аэродинамических кузовов. Особым успехом стал автомобиль Mercedes-Benz W196, на котором аргентинский гонщик Хуан-Мануэль Фанхио выиграл чемпионаты Формулы 1 в 1954 и 1955 годах (см. команда Мерседес в формуле 1). Сам автомобиль построен на основе опыта бывших конструкторов авиадвигателей истребителя Messerschmitt Bf.109 и имел систему впрыска топлива и десмодромный привод клапанов. В 1955 году улучшенная версия автомобиля — Mercedes-Benz W196S (300SLR) под номером 722, за рулём которой сидел знаменитый английский гонщик Стирлинг Мосс, установила не побитый по сей день рекорд гонки Милле Милья. Несмотря на трагический исход гонки 24 часа Ле-Мана, в которой погибли Пьер Левег и 82 зрителя, команда Mercedes-Benz выиграла чемпионат мира в 1955 году. Однако после этого марка ушла из гоночного мира на многие годы. Но успех не мог остаться без последствий. Ещё в 1952 году появилась гоночная модель Mercedes-Benz W194, предшественница SLR, которая смогла финишировать на втором и четвёртом местах в Милле Милья этого же года, а также участвовала в гонках Carrera Panamericana и Targa Florio. Кузов автомобиля состоял из трубчатой рамы, покрытой листами, сделанными из лёгкого запатентованного алюминиевого сплава и имел облегчённый и переделанный вариант шестицилиндрового двигателя от «аденауэра». Самыми интересными элементами конструкции выступали форма кабины и дверей, которые, для обеспечения прочности и уменьшения веса, открывались вверх. Они и дали автомобилю прозвище «крыло чайки». В 1953 году бизнесмен Макс Хоффман предложил фирме Mercedes-Benz создать дорожную версию W194 для развивающегося американского рынка. Результатом стал Mercedes-Benz W198 (300SL). С момента премьеры в 1954 году его футуристические черты и необычные двери гарантировали модели полный успех. Элита США, куда поставлялись более 80 % всех автомобилей, раскупала их на аукционах. Изначально на автомобили устанавливался двигатель с системой из трёх карбюраторов типа Weber развивавший мощность в 115 л. с., однако вскоре компания заменила их на систему впрыска топлива фирмы Bosch, что повысило мощность до 215 л. с. и позволило увеличить максимальную скорость до 250 км/ч. Успех автомобиля 300SL шокировал саму фирму. Однако при всех его плюсах сложная конструкция и долгая сборка делали его стоимость недоступной для старого света. Чувствуя потенциал открывшегося для марки рынка, инженеры Mercedes-Benz сразу принялись разрабатывать массовую модель на базе стандартного «понтона» Mercedes-Benz 190 (W121). При этом автомобиль сохранил многое от 300SL — независимую переднюю подвеску и заднюю подвеску с качающимися полуосями. В апреле 1954 года состоялась премьера «младшего брата» 190SL. Автомобиль выпускался как родстер, либо со съёмной жёсткой крышей, либо со складывающейся брезентовой. Цена на него была почти в два раза меньше, чем у 300SL. Автомобиль оказался очень успешным, особенно среди представительниц слабого пола. В 1957 году 300SL подвергся крупной модернизации, в ходе которой он лишился своей уникальной конструкции дверей-крыльев. Причин этому было несколько: во-первых, автомобиль был скорее гоночным, нежели класса Гран-Туризмо, в который он неожиданно перешёл. Следовательно, в плане удобства имел большие недостатки, такие как отсутствие багажника, слабую вентиляцию (только за счёт задних треугольных форточек, которые могли приоткрыться) и вход и выход пассажиров в салон, который был очень неудобен, особенно для женщин. Ещё одной причиной стала высокая смертность в авариях, вследствие того, что пассажирам трудно выбраться из автомобиля, особенно при его перевороте. Поэтому в 1957 году появился новый 300SL, который превратился в родстер, аналогично 190SL и выпускался как с брезентовой, так и со съёмной жёсткой крышей. При этом автомобиль получил новую, более комфортабельную заднюю подвеску, дисковые тормоза (с 1961 года) и, впервые для Mercedes-Benz, на него поставили новый тип вертикальных фар, которые вскоре станут характерной чертой всех последующих моделей марки вплоть до начала 1970-х годов.',
    'https://www.mercedes-benz-downtowncalgary.ca/wp-content/uploads/sites/54/2018/02/MERC_DowntownCalgary_CurrentOffers_900x300_PrivateSale_2.jpg'
  )
];
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
.list-group {
  padding-top: 20px;
}
.list-group-item {
  color: #343a40;
  text-align: left;
}
.list-group-item:hover{
  color: #343a40;
}
.list-group-item.active {
    z-index: 2;
    color: #fff;
    background-color: #343a40;
    border-color: #343a40;
}
.hystory-tittle {
  padding-top: 20px;
  text-align: left;
}
.hystory-text {
  padding-top: 5px;
  text-align: justify;
}
.list__img {
  padding-top: 20px;
}
/*ANIMATION*/

/*END ANIMATION*/
</style>
